sdaiPutAggrByIterator(Sdai_ItrId*,SdaiPrimitiveType,BTEllipsis)
\details
Sets new values to an aggregate instance that is referenced by a specified iterator.
\param current   [in]  An iterator that refers to the current member of the aggregate.
\param valueType [in] An aggregate value data type.
\remarks
You can set more than one element value through passing them to the function starting from the third parameter.